//Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.

//M = 1; N = 15 -> 120
//M = 4; N = 8. -> 30

int m = 1;
int n = 15;
int a = 0;

while (m<=n)
{
    a = a + m;
    m++;
}
Console.WriteLine(a);